---
kind: other
id: Properties.T:Autodesk.Revit.DB.TransactionGroup
source: html/c13ee266-4e42-97f1-9846-9229c70c72ab.htm
---
# TransactionGroup Properties

Forces all transactions finished inside this group to use modal failure handling
 regardless of what failure handling options are set for those transactions.